ninety-nine-cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "created and updated"], ["updated_at", "2022-11-12 01:08:17.970986"], ["id", 10]]
---
  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(cat_params)